Revit 2027 API
BuiltInFailures.PerformanceFailures.WallsOverlap Property
 Walls overlap. Consider embedding walls, editing their extents or profile to avoid overlapping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallsOverlap { get; }
Public Shared ReadOnly Property WallsOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallsOverlap {
	FailureDefinitionId^ get ();
}
static member WallsOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace